{
    "name": "Zum Tropfenden Kessel",
    "description": "Der Tropfende Kessel wirkt nicht wie ein bekannter und wichtiger Ort, sondern dunkel und schäbig. Heutzutage wird der kleine, schmuddelig wirkende Pub von dem schon älteren Wirt *Tom* geführt. Außer der kurzfristigen Bewirtung bietet der Tropfende Kessel auch Übernachtungsmöglichkeiten in der oberen Etage. Auf einer *Bar* befindet sich ein kleines *Tintenfass* welches eine Feder vermisst sowie eine *Kerze* die vor kurzen ausgegangen sein muss. Über der Bar befindet sich das *Porträt* von Wilhmelm, der Betrunkene. ",
    "items": [],
    "details": [
        {
            "name": "Bar",
            "description": "Die Bar ist mit kleinen Unebenheiten sowie ein paar Reste Kerzenwachs übersäht"
        },
        {
            "name": "Tom",
            "description": "Der Wirt des tropfenden Kessels"
        }
    ],
    "npcs": [
        {
            "id" : "/npcs/tom_vom_tropfenden_kessel.json"
        }
    ],
    "exits": [
        {
            "direction": "Norden",
            "description": "Winkelgassenstraße 1",
            "room_id": "/rooms/winkelgasse/winkelgassenstrasse_1.json"
        }
    ],
    "secrets": [
        {
            "name" : "Tintenfass",
            "description_before_reveal":  "Du wirst das gefühl nicht los, das Tintenfass wäre dir sehr dankbar, wenn du ihm eine neue Feder bringen würdest.",
            "description_after_reveal":  "Das Tintenfass ist dank deiner Hilfe wieder mit einer Feder vereint",
            "needs_item" : "/items/eulenfeder.json",
            "text_on_reveal" : "Du steckst die Eulenfeder in das Tintenfass. Freudig springt die Feder heraus und kritzelt 'das Porträpasswort ist Butterbier' auf die Bar bevor sie wieder zurück in das Tintenfass hüpft."
        },
        {
            "name" : "Porträt",
            "description_before_reveal":  "Das Porträt zeigt den betrunken Zauberer Wilhelm, der mit schief hängenden Hut auf einem Bierkrug gestützt in der Ecke einer Kneipe sitzt.",
            "description_after_reveal":  "Wilhelm der betrunkene zwinktert dir auf dem Porträt zu, sichtlich begeistert über die Wahl deines Getränkes",
            "needs_password" : "Butterbier",
            "text_on_reveal" : "Das Porträt mit Wilhelm dem Betrunkenen rutscht an der Wandhalterung entlang und offenbart eine kleine Schachfigur",
            "reveals_item" : "/items/schachfigur_bauer.json"
        },
        {
            "name" : "Kerze",
            "description_before_reveal":  "Die Kerze ist noch warm und genügend Wachs ist vorhanden, scheit als hätte ein Windstoss sie vor kurzen gelöscht. Mit einem Zauber könntest du sie vielleicht wieder entzünden.",
            "description_after_reveal":  "Die Kerze flackert langsam vor sich hin",
            "needs_spell" : "/spell/incendio.json",
            "text_on_reveal" : "Die Kerze beginnt zu brennen und verstrahlt ein heimeliges Gefühl"
        }

    ]
}